<a href="https://colab.research.google.com/github/ayushiiii28/ayushiiii28/blob/main/Untitled2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#answer 1
def fibonacci(n):
    if n <= 0:
        return []
    elif n == 1:
        return [0]
    elif n == 2:
        return [0, 1]

    fib_sequence = [0, 1]
    for i in range(2, n):
        fib_sequence.append(fib_sequence[-1] + fib_sequence[-2])

    return fib_sequence


print(fibonacci(10))

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [2]:
#answer2
def is_prime(num):
    if num <= 1:
        return False
    if num == 2:
        return True
    if num % 2 == 0:
        return False
    for i in range(3, int(num**0.5) + 1, 2):
        if num % i == 0:
            return False
    return True


print(is_prime(2))
print(is_prime(4))
print(is_prime(17))
print(is_prime(18))

True
False
True
False

In [3]:
#Task 2
#answer1
import pandas as pd
data = {
'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
'Sales': [200, 220, 210, 215, 225],
'Region': ['North', 'South', 'East', 'West', 'North'],
'Manager': ['John', 'Jane', 'Joe', 'Jake', 'John']
}
df = pd.DataFrame(data)
print(df.head())

         Date  Sales Region Manager
0  2024-01-01    200  North    John
1  2024-01-02    220  South    Jane
2  2024-01-03    210   East     Joe
3  2024-01-04    215   West    Jake
4  2024-01-05    225  North    John

In [4]:
#answer2
df['Profit'] = df['Sales'] * 0.1
print(df)

         Date  Sales Region Manager  Profit
0  2024-01-01    200  North    John    20.0
1  2024-01-02    220  South    Jane    22.0
2  2024-01-03    210   East     Joe    21.0
3  2024-01-04    215   West    Jake    21.5
4  2024-01-05    225  North    John    22.5

In [5]:
#answer3
total_sales_by_region = df.groupby('Region')['Sales'].sum()
print(total_sales_by_region)

Region
East     210
North    425
South    220
West     215
Name: Sales, dtype: int64

In [6]:
#answer4
avg_sales_by_region = df.groupby('Region')['Sales'].mean()
region_highest_avg_sales = avg_sales_by_region.idxmax()
highest_avg_sales_value = avg_sales_by_region.max()

print("Task 4: Region with the highest average sales:")
print(f"Region: {region_highest_avg_sales}, Average Sales: {highest_avg_sales_value}")

Task 4: Region with the highest average sales:
Region: South, Average Sales: 220.0

In [9]:
#Task3
#answer1
import pandas as pd
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)
print("Task 1: Displaying first 5 rows of the Titanic DataFrame:")
print(df.head())
print()

Task 1: Displaying first 5 rows of the Titanic DataFrame:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [10]:
#answer2
print("Task 2: Summary statistics of the Titanic DataFrame:")
print(df.describe())
print()

Task 2: Summary statistics of the Titanic DataFrame:
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [11]:
#answer3
print("Task 3: Checking for null values in the Titanic DataFrame:")
print(df.isnull().sum())
print()

Task 3: Checking for null values in the Titanic DataFrame:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [20]:
#answer4
mean_age = df['Age'].mean()
df['Age'].fillna(mean_age, inplace=True)
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name  Sex        Age  SibSp  \
0                              Braund, Mr. Owen Harris    0  22.000000      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...    1  38.000000      1
2                               Heikkinen, Miss. Laina    1  26.000000      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)    1  35.000000      1
4                             Allen, Mr. William Henry    0  35.000000      0
..                                                 ...  ...        ...    ...
886                              Montvila, Rev. Juozas    0  27.000000      0
887                       Graham, Miss. Margaret Edith    1  19.000000      0
888           Johnston, Miss. Catherine Helen "Carrie"    1  29.699118      1
889                              Behr, Mr. Karl Howell    0  26.000000      0
890                                Dooley, Mr. Patrick    0  32.000000      0

     Parch            Ticket     Fare Cabin Embarked  FamilySize
0        0         A/5 21171   7.2500   NaN        S           1
1        0          PC 17599  71.2833   C85        C           1
2        0  STON/O2. 3101282   7.9250   NaN        S           0
3        0            113803  53.1000  C123        S           1
4        0            373450   8.0500   NaN        S           0
..     ...               ...      ...   ...      ...         ...
886      0            211536  13.0000   NaN        S           0
887      0            112053  30.0000   B42        S           0
888      2        W./C. 6607  23.4500   NaN        S           3
889      0            111369  30.0000  C148        C           0
890      0            370376   7.7500   NaN        Q           0

[889 rows x 13 columns]

In [21]:
#answer5
df.dropna(subset=['Embarked'], inplace=True)
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name  Sex        Age  SibSp  \
0                              Braund, Mr. Owen Harris    0  22.000000      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...    1  38.000000      1
2                               Heikkinen, Miss. Laina    1  26.000000      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)    1  35.000000      1
4                             Allen, Mr. William Henry    0  35.000000      0
..                                                 ...  ...        ...    ...
886                              Montvila, Rev. Juozas    0  27.000000      0
887                       Graham, Miss. Margaret Edith    1  19.000000      0
888           Johnston, Miss. Catherine Helen "Carrie"    1  29.699118      1
889                              Behr, Mr. Karl Howell    0  26.000000      0
890                                Dooley, Mr. Patrick    0  32.000000      0

     Parch            Ticket     Fare Cabin Embarked  FamilySize
0        0         A/5 21171   7.2500   NaN        S           1
1        0          PC 17599  71.2833   C85        C           1
2        0  STON/O2. 3101282   7.9250   NaN        S           0
3        0            113803  53.1000  C123        S           1
4        0            373450   8.0500   NaN        S           0
..     ...               ...      ...   ...      ...         ...
886      0            211536  13.0000   NaN        S           0
887      0            112053  30.0000   B42        S           0
888      2        W./C. 6607  23.4500   NaN        S           3
889      0            111369  30.0000  C148        C           0
890      0            370376   7.7500   NaN        Q           0

[889 rows x 13 columns]

In [22]:
#answer6
df['FamilySize'] = df['SibSp'] + df['Parch']
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name  Sex        Age  SibSp  \
0                              Braund, Mr. Owen Harris    0  22.000000      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...    1  38.000000      1
2                               Heikkinen, Miss. Laina    1  26.000000      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)    1  35.000000      1
4                             Allen, Mr. William Henry    0  35.000000      0
..                                                 ...  ...        ...    ...
886                              Montvila, Rev. Juozas    0  27.000000      0
887                       Graham, Miss. Margaret Edith    1  19.000000      0
888           Johnston, Miss. Catherine Helen "Carrie"    1  29.699118      1
889                              Behr, Mr. Karl Howell    0  26.000000      0
890                                Dooley, Mr. Patrick    0  32.000000      0

     Parch            Ticket     Fare Cabin Embarked  FamilySize
0        0         A/5 21171   7.2500   NaN        S           1
1        0          PC 17599  71.2833   C85        C           1
2        0  STON/O2. 3101282   7.9250   NaN        S           0
3        0            113803  53.1000  C123        S           1
4        0            373450   8.0500   NaN        S           0
..     ...               ...      ...   ...      ...         ...
886      0            211536  13.0000   NaN        S           0
887      0            112053  30.0000   B42        S           0
888      2        W./C. 6607  23.4500   NaN        S           3
889      0            111369  30.0000  C148        C           0
890      0            370376   7.7500   NaN        Q           0

[889 rows x 13 columns]

In [23]:
#answer7
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name  Sex        Age  SibSp  \
0                              Braund, Mr. Owen Harris  NaN  22.000000      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  NaN  38.000000      1
2                               Heikkinen, Miss. Laina  NaN  26.000000      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  NaN  35.000000      1
4                             Allen, Mr. William Henry  NaN  35.000000      0
..                                                 ...  ...        ...    ...
886                              Montvila, Rev. Juozas  NaN  27.000000      0
887                       Graham, Miss. Margaret Edith  NaN  19.000000      0
888           Johnston, Miss. Catherine Helen "Carrie"  NaN  29.699118      1
889                              Behr, Mr. Karl Howell  NaN  26.000000      0
890                                Dooley, Mr. Patrick  NaN  32.000000      0

     Parch            Ticket     Fare Cabin Embarked  FamilySize
0        0         A/5 21171   7.2500   NaN        S           1
1        0          PC 17599  71.2833   C85        C           1
2        0  STON/O2. 3101282   7.9250   NaN        S           0
3        0            113803  53.1000  C123        S           1
4        0            373450   8.0500   NaN        S           0
..     ...               ...      ...   ...      ...         ...
886      0            211536  13.0000   NaN        S           0
887      0            112053  30.0000   B42        S           0
888      2        W./C. 6607  23.4500   NaN        S           3
889      0            111369  30.0000  C148        C           0
890      0            370376   7.7500   NaN        Q           0

[889 rows x 13 columns]

In [24]:
#answer8
avg = df.groupby('Pclass')['Fare'].mean()
print("Task 8: Average fare for each passenger class:")
print(avg)
print()

Task 8: Average fare for each passenger class:
Pclass
1    84.193516
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [25]:
#answer9
common_port = df['Embarked'].mode()[0]
print("Task 9: Most common port of embarkation:", common_port)
print()

Task 9: Most common port of embarkation: S

In [26]:
#answer10
survival = pd.pivot_table(df, values='Survived', index='Sex', columns='Pclass', aggfunc='mean')
print("Task 10: Pivot table showing survival rate for each Sex and Pclass combination:")
print(survival)

Task 10: Pivot table showing survival rate for each Sex and Pclass combination:
Empty DataFrame
Columns: []
Index: []